# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # 0-P1/2
  [[-1, 1, Stage0, []],
   # 1-P2/4
   [-1, 1, Stage1, [24, 32, 2, 2.0, None, None, 3, 0., 16, 7, False, True, 0., 0., 0.04036, False, True]],
   # 2-P3/8
   [-1, 1, Stage2, [32, 48, 2, 2.5, None, None, 3, 0., 16, 7, False, True, 0., 0., 0.04036, False, True]],
   # 3-P4/16
   [-1, 1, Stage3, [48, 80, 8, 3.0, None, None, 5, 0., 20, 7, True, True, 0., 0., 0.04036, False, True]],
   # 4-P5/32
   [-1, 1, Stage4, [80, 168, 3, 3.5, None, None, 5, 0., 20, 7, True, True, 0., 0., 0.04036, False, True]],
   # 5
   [-1, 1, SPPF, [168, 1024, 5]],  # 6
#    [-1, 1, CSPSPPF_ori, [168, 512, 5]],  # 6
  ]


# YOLOv5 v6.0 head
head:
  [[-1, 1, ConvNormAct, [1024, 512, 1, 1]], # 6
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 7
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4  8
   [-1, 3, C3, [512, False]],  #  9

   [-1, 1, ConvNormAct, [512, 256, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3 12
   [-1, 3, C3, [256, False]],  # 13

   [-1, 1, ConvNormAct, [256, 256, 3, 2]], # 14
   [[-1, 10], 1, Concat, [1]],  # cat head P4 15
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, ConvNormAct, [512, 512, 3, 2]], # 17
   [[-1, 6], 1, Concat, [1]],  # cat head P5  18
   [-1, 3, C3, [1024, False]],  # 19

   [[13, 16, 19], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)  20
  ]
